FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32F103_IAR/STM32F10xFWLib/src/stm32f10x_tim1.c
/*******************************************************************************
* Function Name  : TIM1_CCxNCmd
* Description    : Enables or disables the TIM1 Capture Compare Channel xN.
* Input          : - TIM1_Channel: specifies the TIM1 Channel
*                    This parmeter can be one of the following values:
*                       - TIM1_Channel1: TIM1 Channel1
*                       - TIM1_Channel2: TIM1 Channel2
*                       - TIM1_Channel3: TIM1 Channel3
*                 - Newstate: specifies the TIM1 Channel CCxNE bit new state.
*                   This parameter can be: ENABLE or DISABLE. 
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_CCxNCmd(u16 TIM1_Channel, FunctionalState Newstate)
{
  /* Check the parameters */
  assert(IS_TIM1_COMPLEMENTARY_CHANNEL(TIM1_Channel));
  assert(IS_FUNCTIONAL_STATE(Newstate));

  if(TIM1_Channel == TIM1_Channel_1)
  {
    /* Set or Reset the CC1NE Bit */
    *(vu32 *) CCER_CC1NE_BB = (u16)Newstate;  
  }
  else if(TIM1_Channel == TIM1_Channel_2)
  {
    /* Set or Reset the CC2NE Bit */
    *(vu32 *) CCER_CC2NE_BB = (u16)Newstate;
  }
  else 
  {
    /* Set or Reset the CC3NE Bit */
    *(vu32 *) CCER_CC3NE_BB = (u16)Newstate;
  }
}

/*******************************************************************************
* Function Name  : TIM1_SelectOCxM
* Description    : Selects the TIM1 Ouput Compare Mode.
*                  This function disables the selected channel before changing 
*                  the Ouput Compare Mode. User has to enable this channel using
*                  TIM1_CCxCmd and TIM1_CCxNCmd functions.
* Input          : - TIM1_Channel: specifies the TIM1 Channel
*                    This parmeter can be one of the following values:
*                       - TIM1_Channel1: TIM1 Channel1
*                       - TIM1_Channel2: TIM1 Channel2
*                       - TIM1_Channel3: TIM1 Channel3
*                       - TIM1_Channel4: TIM1 Channel4
*                  - TIM1_OCMode: specifies the TIM1 Output Compare Mode.
*                    This paramter can be one of the following values:
*                       - TIM1_OCMode_Timing
*                       - TIM1_OCMode_Active
*                       - TIM1_OCMode_Toggle
*                       - TIM1_OCMode_PWM1
*                       - TIM1_OCMode_PWM2
*                       - TIM1_ForcedAction_Active
*                       - TIM1_ForcedAction_InActive
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SelectOCxM(u16 TIM1_Channel, u16 TIM1_OCMode)
{
  /* Check the parameters */
  assert(IS_TIM1_CHANNEL(TIM1_Channel));
  assert(IS_TIM1_OCM(TIM1_OCMode));

  if(TIM1_Channel == TIM1_Channel_1)
  {
    /* Disable the Channel 1: Reset the CCE Bit */
    *(vu32 *) CCER_CC1E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR1 &= OC13Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR1 |= TIM1_OCMode;
  }
  else if(TIM1_Channel == TIM1_Channel_2)
  {
    /* Disable the Channel 2: Reset the CCE Bit */
    *(vu32 *) CCER_CC2E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR1 &= OC24Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR1 |= (u16)((u16)TIM1_OCMode << 8);
  }
  else if(TIM1_Channel == TIM1_Channel_3)
  {
    /* Disable the Channel 3: Reset the CCE Bit */
    *(vu32 *) CCER_CC3E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR2 &= OC13Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR2 |= TIM1_OCMode;
  }
  else
  {
    /* Disable the Channel 4: Reset the CCE Bit */
    *(vu32 *) CCER_CC4E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR2 &= OC24Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR2 |= (u16)((u16)TIM1_OCMode << 8);
  }
}

/*******************************************************************************
* Function Name  : TIM1_SetAutoreload
* Description    : Sets the TIM1 Autoreload Register value.
* Input          : - Autoreload: specifies the Autoreload register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetAutoreload(u16 Autoreload)
{
  /* Set the Autoreload Register value */
  TIM1->ARR = Autoreload;
}

/*******************************************************************************
* Function Name  : TIM1_SetCompare1
* Description    : Sets the TIM1 Capture Compare1 Register value.
* Input          : - Compare1: specifies the Capture Compare1 register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCompare1(u16 Compare1)
{
  /* Set the Capture Compare1 Register value */
  TIM1->CCR1 = Compare1;
}

/*******************************************************************************
* Function Name  : TIM1_SetCompare2
* Description    : Sets the TIM1 Capture Compare2 Register value.
* Input          : - Compare2: specifies the Capture Compare2 register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCompare2(u16 Compare2)
{
  /* Set the Capture Compare2 Register value */
  TIM1->CCR2 = Compare2;
}

/*******************************************************************************
* Function Name  : TIM1_SetCompare3
* Description    : Sets the TIM1 Capture Compare3 Register value.
* Input          : - Compare3: specifies the Capture Compare3 register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCompare3(u16 Compare3)
{
  /* Set the Capture Compare3 Register value */
  TIM1->CCR3 = Compare3;
}

