FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32F103_IAR/STM32F10xFWLib/src/stm32f10x_tim1.c
/*******************************************************************************
* Function Name  : TIM1_GetCapture1
* Description    : Gets the TIM1 Input Capture 1 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 1 Register value.
*******************************************************************************/
u16 TIM1_GetCapture1(void)
{
  /* Get the Capture 1 Register value */
  return TIM1->CCR1;
}

/*******************************************************************************
* Function Name  : TIM1_GetCapture2
* Description    : Gets the TIM1 Input Capture 2 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 2 Register value.
*******************************************************************************/
u16 TIM1_GetCapture2(void)
{
  /* Get the Capture 2 Register value */
  return TIM1->CCR2;
}

/*******************************************************************************
* Function Name  : TIM1_GetCapture3
* Description    : Gets the TIM1 Input Capture 3 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 3 Register value.
*******************************************************************************/
u16 TIM1_GetCapture3(void)
{
  /* Get the Capture 3 Register value */
  return TIM1->CCR3;
}

/*******************************************************************************
* Function Name  : TIM1_GetCapture4
* Description    : Gets the TIM1 Input Capture 4 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 4 Register value.
*******************************************************************************/
u16 TIM1_GetCapture4(void)
{
  /* Get the Capture 4 Register value */
  return TIM1->CCR4;
}

/*******************************************************************************
* Function Name  : TIM1_GetCounter
* Description    : Gets the TIM1 Counter value.
* Input          : None
* Output         : None
* Return         : Counter Register value.
*******************************************************************************/
u16 TIM1_GetCounter(void)
{
  /* Get the Counter Register value */
  return TIM1->CNT;
}

/*******************************************************************************
* Function Name  : TIM1_GetPrescaler
* Description    : Gets the TIM1 Prescaler value.
* Input          : None
* Output         : None
* Return         : Prescaler Register value.
*******************************************************************************/
u16 TIM1_GetPrescaler(void)
{
  /* Get the Prescaler Register value */
  return TIM1->PSC;
}

/*******************************************************************************
* Function Name  : TIM1_GetFlagStatus
* Description    : Checks whether the specified TIM1 flag is set or not.
* Input          : - TIM1_FLAG: specifies the flag to check.
*                    This parameter can be one of the following values:
*                       - TIM1_FLAG_Update: TIM1 update Flag
*                       - TIM1_FLAG_CC1: TIM1 Capture Compare 1 Flag
*                       - TIM1_FLAG_CC2: TIM1 Capture Compare 2 Flag
*                       - TIM1_FLAG_CC3: TIM1 Capture Compare 3 Flag
*                       - TIM1_FLAG_CC4: TIM1 Capture Compare 4 Flag
*                       - TIM1_FLAG_COM: TIM1 Commutation Flag
*                       - TIM1_FLAG_Trigger: TIM1 Trigger Flag
*                       - TIM1_FLAG_Break: TIM1 Break Flag
*                       - TIM1_FLAG_CC1OF: TIM1 Capture Compare 1 overcapture Flag
*                       - TIM1_FLAG_CC2OF: TIM1 Capture Compare 2 overcapture Flag
*                       - TIM1_FLAG_CC3OF: TIM1 Capture Compare 3 overcapture Flag
*                       - TIM1_FLAG_CC4OF: TIM1 Capture Compare 4 overcapture Flag
* Output         : None
* Return         : The new state of TIM1_FLAG (SET or RESET).
*******************************************************************************/
FlagStatus TIM1_GetFlagStatus(u16 TIM1_FLAG)
{
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert(IS_TIM1_GET_FLAG(TIM1_FLAG));

  if ((TIM1->SR & TIM1_FLAG) != (u16)RESET )
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : TIM1_ClearFlag
* Description    : Clears the TIM1’s pending flags.
* Input          : - TIM1_FLAG: specifies the flag to clear.
*                    This parameter can be any combination of the following values:
*                       - TIM1_FLAG_Update: TIM1 update Flag
*                       - TIM1_FLAG_CC1: TIM1 Capture Compare 1 Flag
*                       - TIM1_FLAG_CC2: TIM1 Capture Compare 2 Flag
*                       - TIM1_FLAG_CC3: TIM1 Capture Compare 3 Flag
*                       - TIM1_FLAG_CC4: TIM1 Capture Compare 4 Flag
*                       - TIM1_FLAG_COM: TIM1 Commutation Flag
*                       - TIM1_FLAG_Trigger: TIM1 Trigger Flag
*                       - TIM1_FLAG_Break: TIM1 Break Flag
*                       - TIM1_FLAG_CC1OF: TIM1 Capture Compare 1 overcapture Flag
*                       - TIM1_FLAG_CC2OF: TIM1 Capture Compare 2 overcapture Flag
*                       - TIM1_FLAG_CC3OF: TIM1 Capture Compare 3 overcapture Flag
*                       - TIM1_FLAG_CC4OF: TIM1 Capture Compare 4 overcapture Flag
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_ClearFlag(u16 TIM1_FLAG)
{
  /* Check the parameters */
  assert(IS_TIM1_CLEAR_FLAG(TIM1_FLAG));

  /* Clear the flags */
  TIM1->SR &= (u16)~TIM1_FLAG;
}

/*******************************************************************************
* Function Name  : TIM1_GetITStatus
* Description    : Checks whether the TIM1 interrupt has occurred or not.
* Input          : - TIM1_IT: specifies the TIM1 interrupt source to check.
*                    This parameter can be one of the following values:
*                       - TIM1_IT_Update: TIM1 update Interrupt source
*                       - TIM1_IT_CC1: TIM1 Capture Compare 1 Interrupt source
*                       - TIM1_IT_CC2: TIM1 Capture Compare 2 Interrupt source
*                       - TIM1_IT_CC3: TIM1 Capture Compare 3 Interrupt source
*                       - TIM1_IT_CC4: TIM1 Capture Compare 4 Interrupt source
*                       - TIM1_IT_COM: TIM1 Commutation Interrupt
*                         source
*                       - TIM1_IT_Trigger: TIM1 Trigger Interrupt source
*                       - TIM1_IT_Break: TIM1 Break Interrupt source
* Output         : None
* Return         : The new state of the TIM1_IT(SET or RESET).
*******************************************************************************/
ITStatus TIM1_GetITStatus(u16 TIM1_IT)
{
  ITStatus bitstatus = RESET;
  
  u16 TIM1_itStatus = 0x0, TIM1_itEnable = 0x0;

  /* Check the parameters */
  assert(IS_TIM1_GET_IT(TIM1_IT));
  
