FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32F103_IAR/STM32F10xFWLib/src/stm32f10x_tim1.c
  /* Select the Input and set the filter */
  tmpccmr2 &= CCMR_CC13S_Mask & CCMR_IC13F_Mask;
  tmpccmr2 |= (u16)TIM1_ICSelection | (u16)((u16)TIM1_ICFilter << 4);

  TIM1->CCMR2 = (u16)tmpccmr2;

  /* Select the Polarity */
  *(vu32 *) CCER_CC3P_BB = TIM1_ICPolarity;

  /* Set the CCE Bit */
  *(vu32 *) CCER_CC3E_BB = CCER_CCE_Set;
}

/*******************************************************************************
* Function Name  : TI4_Config
* Description    : Configure the TI4 as Input.
* Input          : - TIM1_ICPolarity : The Input Polarity.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPolarity_Rising
*                       - TIM1_ICPolarity_Falling
*                  - TIM1_ICSelection: specifies the input to be used.
*                    This parameter can be one of the following values:
*                       - TIM1_ICSelection_DirectTI: TIM1 Input 4 is selected to
*                         be connected to IC4.
*                       - TIM1_ICSelection_IndirectTI: TIM1 Input 4 is selected to
*                         be connected to IC3.
*                       - TIM1_ICSelection_TRGI: TIM1 Input 4 is selected to be
*                         connected to TRGI.
*                  - TIM1_ICFilter: Specifies the Input Capture Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Output         : None
* Return         : None
*******************************************************************************/
static void TI4_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter)
{
  u32 tmpccmr2 = 0;

  tmpccmr2 = TIM1->CCMR2;
  
  /* Disable the Channel 4: Reset the CCE Bit */
  *(vu32 *) CCER_CC4E_BB = CCER_CCE_Reset;

  /* Select the Input and set the filter */
  tmpccmr2 &= CCMR_CC24S_Mask & CCMR_IC24F_Mask;
  tmpccmr2 |= (u16)((u16)TIM1_ICSelection << 8) | (u16)((u16)TIM1_ICFilter << 12);

  TIM1->CCMR2 = (u16)tmpccmr2;

  /* Select the Polarity */
  *(vu32 *) CCER_CC4P_BB = TIM1_ICPolarity;

  /* Set the CCE Bit */
  *(vu32 *) CCER_CC4E_BB = CCER_CCE_Set;
}

/*******************************************************************************
* Function Name  : ETR_Config
* Description    : Configure the External Trigger
* Input          : - TIM1_ExtTRGPrescaler: The external Trigger Prescaler.
*                    This parameter can be one of the following values:
*                       - TIM1_ExtTRGPSC_OFF
*                       - TIM1_ExtTRGPSC_DIV2
*                       - TIM1_ExtTRGPSC_DIV4
*                       - TIM1_ExtTRGPSC_DIV8
*                  - TIM1_ExtTRGPolarity: The external Trigger Polarity.
*                    This parameter can be one of the following values:
*                       - TIM1_ExtTRGPolarity_Inverted
*                       - TIM1_ExtTRGPolarity_NonInverted
*                  - ExtTRGFilter: External Trigger Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Output         : None
* Return         : None
*******************************************************************************/
static void ETR_Config(u16 TIM1_ExtTRGPrescaler, u16 TIM1_ExtTRGPolarity,
                       u16 ExtTRGFilter)
{
  u32 tmpsmcr = 0;

  tmpsmcr = TIM1->SMCR;

  /* Set the Prescaler, the Filter value and the Polarity */
  tmpsmcr &= SMCR_ETR_Mask;
  tmpsmcr |= TIM1_ExtTRGPrescaler | TIM1_ExtTRGPolarity | (u16)((u16)ExtTRGFilter << 8);

  TIM1->SMCR = (u16)tmpsmcr;
}

/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
